'use client'
import { Container, Grid, Typography } from "@mui/material";
import BoxContainer from "/components/BoxContainer/BoxContainer";

export default function PageContent() {
  return (
    <Container sx={{ pt: 6, pb: 10 }}>
    <Grid container justifyContent="center" p={1}>
      <Grid item xs={12} md={10}>
        <BoxContainer p={3}>
          <Typography
            variant="h4"
            textTransform="uppercase"
            sx={{ textAlign: "center", color: "primary" }}
          >
            договір оферти
          </Typography>
          <Typography variant="body2" mt={2}>
            Цей Договір є публічним договором – Договором публічної оферти,
            тобто відповідно до статті 633 Цивільного кодексу України його
            умови однакові для всіх покупців незалежно від статусу (фізична
            особа, юридична особа, фізична особа – підприємець). При повній
            згоді з даним Договором, покупець приймає умови і порядок
            оформлення замовлення, оплати товару, доставки товару. Цей
            Договір є угодою між інтернет-магазином «syodo.com.ua», в особі
            ФОП Балінський Максим Миколайович) (надалі по тексту –
            «Продавець») і будь-якою юридичною особою, фізичною
            особою-підприємцем або фізичною особою, користувачем послуг
            інтернет-магазину, яка надалі іменується “Покупець” (надалі –
            «Покупець»), що включає всі суттєві умови організації купівлі –
            продажу дистанційним способом (тобто через Інтернет – магазин).
          </Typography>
          <Typography variant="body2" mt={2}>
            Умови даного Договору регулюють взаємовідносини Продавця і
            Покупця та визначаються Законом України «Про захист прав
            споживачів» № 1023-XII від 12 травня 1991 року, Правилами
            роздрібної торгівлі непродовольчими товарами, затвердженими
            наказом Міністерства економіки України № 104 від 19 квітня 2007
            року.
          </Typography>
          <Typography variant="body2" mt={2}>
            Ця угода носить характер публічної оферти, є еквівалентом “усної
            угоди” і відповідно до чинного законодавства України має належну
            юридичну силу.
          </Typography>
          <Typography variant="h6" mt={2}>
            1. Загальні положення
          </Typography>
          <Typography variant="body2" mt={2}>
            1.1. Цей договір є публічною офертою ( відповідно до ст. 633,
            641 і гл. 63 Цивільного кодексу України) і містить всі істотні
            умови організації купівлі-продажу дистанційним способом, тобто
            через інтернет-магазин.
          </Typography>
          <Typography variant="body2" mt={2}>
            1.2. У відповідності до ст. 642 Цивільного Кодексу України
            повним і безсуперечним прийняттям умов публічного договору,
            тобто публічної оферти інтернет-магазину є факт натисканням на
            посилання “Оформити замовлення”, «Розмістити замовлення» або
            «Купити в 1 клік та оплати замовлення в розмірі 100% на умовах
            цієї угоди.
          </Typography>
          <Typography variant="body2" mt={2}>
            1.3. Публічна оферта також є прийнятою при реєстрації Покупця на
            сайті інтернет-магазину.
          </Typography>
          <Typography variant="body2" mt={2}>
            1.4. Укладаючи Договір, Покупець підтверджує, що цілком і
            повністю ознайомлений та згоден з його умовами, а також, у разі,
            якщо Покупець є фізичною особою, дає дозвіл на обробку своїх
            персональних даних з метою можливості виконання умов цього
            Договору, можливості проведення взаєморозрахунків, а також для
            отримання рахунків, актів та інших документів. Дозвіл на обробку
            персональних даних діє протягом усього строку дії Договору. Крім
            цього, укладанням цього Договору, Покупець підтверджує, що йому
            повідомлено (без додаткового повідомлення) про права,
            встановлені Законом України «Про захист персональних даних», про
            цілі збору даних. Обсяг прав Покупця, як суб’єкта персональних
            даних відповідно до Закону України «Про захист персональних
            даних», йому відомий і зрозумілий.
          </Typography>
          <Typography variant="h6" mt={2}>
            2. Терміни та визначення
          </Typography>
          <Typography variant="body2" mt={2}>
            2.1. «Інтернет – магазин» -сайт Продавця («syodo.com.ua»),
            створений для укладення договорів роздрібної та оптової купівлі
            – продажу на підставі ознайомлення Покупця з запропонованим
            Продавцем описом Товару на фотознімках, за допомогою мережі
            Інтернет, що виключає можливість безпосереднього ознайомлення
            Покупця з Товаром – дистанційним засобом продажу товару.
          </Typography>
          <Typography variant="body2" mt={2}>
            2.2. “Товар” – перелік найменувань асортименту, представлений в
            інтернет-магазині.
          </Typography>
          <Typography variant="body2" mt={2}>
            2.3. “Персональні дані” – будь-яка інформація, яка прямо чи
            опосередковано відноситься до певної особи, чи до особи, яка
            визначається.
          </Typography>
          <Typography variant="body2" mt={2}>
            2.4. «Істотний недолік Товару» – недолік, який робить неможливим
            чи недопустимим використання товару відповідно до його цільового
            призначення, виник з вини виробника (Продавця), після його
            усунення проявляється знову з незалежних від споживача причин і
            при цьому наділений хоча б однією з нижченаведених ознак:
          </Typography>
          <Typography variant="body2" mt={2}>
            А) він взагалі не може бути усунутий;
          </Typography>
          <Typography variant="body2">
            Б) його усунення потребує понад чотирнадцять календарних днів;
          </Typography>
          <Typography variant="body2">
            В) він робить товар суттєво іншим, ніж передбачено договором.
          </Typography>
          <Typography variant="h6" mt={2}>
            3. Предмет договору
          </Typography>
          <Typography variant="body2" mt={2}>
            3.1. Інтернет-магазин зобов’язується передати у власність
            Покупцеві товар, а Покупець зобов’язується оплатити і прийняти
            товар на умовах Цього договору.
          </Typography>
          <Typography variant="body2" mt={2}>
            3.2. Цей договір регулює купівлю-продаж в інтернет-магазині, в
            тому числі:
          </Typography>
          <Typography variant="body2" mt={2}>
            А) добровільний вибір Покупцем товарів в інтернет-магазині по
            категоріям;
          </Typography>
          <Typography variant="body2">
            Б) самостійне оформлення Покупцем замовлення на сайті в
            інтернет-магазині;
          </Typography>
          <Typography variant="body2">
            В) оплата Покупцем замовлення, оформленого в інтернет-магазині;
          </Typography>
          <Typography variant="body2">
            Г) виконання і передача замовлення Покупцеві у власність на
            умовах Цього договору.
          </Typography>
          <Typography variant="h6" mt={2}>
            4. Порядок оформлення замовлення
          </Typography>
          <Typography variant="body2" mt={2}>
            4.1. Покупець самостійно оформляє замовлення онлайн в
            інтернет-магазині або за допомогою телефонних засобів зв’язку за
            контактами, вказаними в інтернет-магазині.
          </Typography>
          <Typography variant="h6" mt={2}>
            5. Вартість і порядок оплати товару
          </Typography>
          <Typography variant="body2" mt={2}>
            5.1. Повна вартість товару вказується на сторінках
            інтернет-магазину Продавця.
          </Typography>
          <Typography variant="body2" mt={2}>
            5.2. Ціни на Товари і послуги можуть змінюватися в залежності
            від кон’юнктури ринку, що відбивається на цінах в
            інтернет-магазині. Продавець не може змінювати ціну для
            конкретного Покупця, в разі, якщо той вже прийняв умови Продавця
            та здійснив у встановленому цим договором порядку оплату Товару
            (послуг).
          </Typography>
          <Typography variant="body2" mt={2}>
            5.3. Покупець оплачує замовлення протягом 2-х робочих днів (в
            розмірі 100% передплати) за допомогою банківського переказу
            грошей на поточний рахунок Продавця, що вказаний в рахунку, в
            т.ч. За допомогою Інтернет-банкінгу.
          </Typography>
          <Typography variant="h6" mt={2}>
            6. Доставка замовлення
          </Typography>
          <Typography variant="body2" mt={2}>
            6.1. Відвантаження товару Покупцю відбувається після надходження
            від Покупця 100% оплати по виставленому рахунку.
          </Typography>
          <Typography variant="body2" mt={2}>
            6.2. Доставка і повернення товару виконується силами Продавця
            або транспортної компанії (перевізником) за рахунок Покупця.
            Загальний строк доставки не може перевищувати 10 днів.
          </Typography>
          <Typography variant="body2" mt={2}>
            6.3. Вартість доставки в Інтернет – магазині не вказується,
            оскільки залежить від діючих тарифів транспортної компанії
            (перевізника).
          </Typography>
          <Typography variant="body2" mt={2}>
            6.4. При замовленні оптових партій, терміни і методи доставки
            узгоджуються окремо в кожному конкретному випадку.
          </Typography>
          <Typography variant="body2" mt={2}>
            6.5. Продавець не несе відповідальності за термін доставки
            замовлення, тому що вони залежать від дій третіх осіб
            (перевізників).
          </Typography>
          <Typography variant="body2" mt={2}>
            6.6. Оплата вартості доставки здійснюється Покупцем
            Компанії-перевізнику самостійно, при отриманні товару. Точна
            вартість доставки визначається Компанією-перевізником.
          </Typography>
          <Typography variant="h6" mt={2}>
            7. Повернення товару належної якості
          </Typography>
          <Typography variant="body2" mt={2}>
            7.1. Покупець має право обміняти Товар належної якості на
            аналогічний у продавця в якого він був придбаний, якщо товар не
            задовольнив його за формою, габаритами, фасоном, кольором,
            розміром або з інших причин не може бути ним використаний за
            призначенням за наступними умовами:
          </Typography>
          <Typography variant="body2" mt={2}>
            А) товар для обміну Продавцю надано протягом не більше
            чотирнадцяти днів, не рахуючи дня купівлі;
          </Typography>
          <Typography variant="body2">
            Б) товар може бути замінений якщо він жодного разу не був в
            експлуатації, не містить сліди використання і якщо збережено
            його товарний вигляд, споживчі властивості, пломби,
            ярлики,плівки, не порушено цілісність пакування як самого
            товару, так і комплектуючих до нього;
          </Typography>
          <Typography variant="body2">
            В) товар не містить подряпин, сколів, потертості, повністю
            справний;
          </Typography>
          <Typography variant="body2">
            Г) збережена повна комплектність проданого товару;
          </Typography>
          <Typography variant="body2">
            Ґ) товар може бути замінений при пред’явленні Покупцем
            розрахункового документа, виданого Покупцю разом з проданим
            Товаром.
          </Typography>
          <Typography variant="body2" mt={2}>
            7.1.1. Вимоги п.7.1. Не поширюються на товари, які у
            відповідності до Додатку №3 до Постанови Кабінету Міністрів
            України від 19.03.94 №172 «Про
          </Typography>
          <Typography variant="body2" mt={2}>
            Реалізацію окремих положень Закону України «Про захист прав
            споживачів», віднесені до Переліку товарів, належної якості, що
            не підлягають обміну (поверненню)
          </Typography>
          <Typography variant="body2" mt={2}>
            7.2. У разі, якщо Товар не відповідає умовам визначеним пп. А) –
            Ґ) п. 7.1., Продавець має право відмовити в обміні Товару.
          </Typography>
          <Typography variant="body2" mt={2}>
            7.3. Транспортні витрати на доставку Товару при обміні за п.
            7.1. Покладаються на Покупця.
          </Typography>
          <Typography variant="body2" mt={2}>
            7.4. При обміні товару його гарантійний строк обчислюється
            заново від дня обміну.
          </Typography>
          <Typography variant="body2" mt={2}>
            7.5. Якщо на момент обміну аналогічного товару немає у продажу,
            Покупець має право або придбати будь-які інші товари з наявного
            асортименту з відповідним перерахуванням вартості, або розірвати
            договір та одержати назад гроші у розмірі вартості повернутого
            товару, або здійснити обмін товару на аналогічний при першому ж
            надходженні відповідного товару в продаж.
          </Typography>
          <Typography variant="h6" mt={2}>
            8. Права та обов’язки сторін
          </Typography>
          <Typography variant="body2" mt={2}>
            8.1. Покупець зобов’язаний:
          </Typography>
          <Typography variant="body2" mt={2}>
            А) ознайомитись з інформацією про Товар, яка розміщена на сайті
            Продавця;
          </Typography>
          <Typography variant="body2">
            Б) самостійно оформити замовлення на сайті;
          </Typography>
          <Typography variant="body2">
            В) своєчасно оплатити та отримати замовлення у Перевізника на
            умовах цього договору;
          </Typography>
          <Typography variant="body2">
            Г) при отриманні товару у перевізника впевнитися у його
            цілісності та комплектності шляхом огляду вмісту упаковки. У
            випадку виявлення пошкоджень та неповної комплектації –
            зафіксувати їх в акті, який разом із Покупцем повинен підписати
            співробітник перевізника.
          </Typography>
          <Typography variant="body2" mt={2}>
            8.2. Покупець має право вимагати від інтернет-магазину
            дотримання умов цього договору.
          </Typography>
          <Typography variant="body2" mt={2}>
            8.3. Інтернет – магазин зобов’язаний:
          </Typography>
          <Typography variant="body2" mt={2}>
            А) дотримувати умов цього договору;
          </Typography>
          <Typography variant="body2">
            Б) передати Покупцю товар у відповідності з обраним зразком,
            розміщеним в інтернет-магазині, оформленим замовленням та
            умовами цього договору;
          </Typography>
          <Typography variant="body2">
            В) інтернет-магазин не несе відповідальності, не може виступати
            в якості відповідача у суді і не відшкодовує збитки, що виникли
            у Покупця через дію чи бездіяльність третіх осіб.
          </Typography>
          <Typography variant="body2" mt={2}>
            8.4. Інтернет – магазин має право:
          </Typography>
          <Typography variant="body2" mt={2}>
            А) в односторонньому порядку призупинити надання послуг за цим
            Договором у випадку порушення Покупцем умов цього Договору.
          </Typography>
          <Typography variant="h6" mt={2}>
            9. Порядок прийому товару Покупцем
          </Typography>
          <Typography variant="body2" mt={2}>
            9.1. При отриманні Товару на складі перевізника, від кур’єра або
            Продавця, Покупець зобов’язаний перевірити зовнішню цілісність
            упаковки, після чого відкрити її та безпосередньо пересвідчитися
            у належному зовнішньому стані Товару (відсутності механічних
            пошкоджень) та повноті його комплектності.
          </Typography>
          <Typography variant="body2" mt={2}>
            9.2. У випадку наявності хоча б одного з перерахованих в п.9.1.
            Договору недоліків, Покупець зобов’язаний зафіксувати його у
            складеному акті довільної форми. Акт повинен бути підписаний
            Покупцем та співробітником перевізника або Продавця..Протягом 1
            (одного) дня з моменту підписання Акту Покупець зобов’язаний
            повідомити менеджера (представника Продавця відповідального за
            оформлення замовлення на Товар) про виявлені недоліки та
            домовитися про заміну Товару.
          </Typography>
          <Typography variant="body2" mt={2}>
            9.3. Сторони погодили, що у випадку недотримання обов’язкових
            вимог вказаної процедури, визнається отримання Покупцем Товару у
            належному стані – без будь-яких механічних пошкоджень та у
            повній комплектності.
          </Typography>
          <Typography variant="body2" mt={2}>
            9.4. У разі виявлення протягом встановленого гарантійного строку
            (строку придатності) істотних недоліків, які виникли з вини
            виробника товару (Продавця), або фальсифікації Товару,
            підтвердженої висновком експертизи, Покупець, в порядку та у
            строки, встановлені гарантійними зобов’язаннями виробника
            Товару, з врахуванням умов Договору-оферти має право за своїм
            вибором вимагати від Продавця:
          </Typography>
          <Typography variant="body2" mt={2}>
            9.4.1. Розірвання договору та повернення сплаченої за Товар
            грошової суми;
          </Typography>
          <Typography variant="body2" mt={2}>
            9.4.2. Заміни товару на такий же Товар або на аналогічний, з
            числа наявних у Продавця.
          </Typography>
          <Typography variant="body2" mt={2}>
            9.5. У такому випадку, при підтвердженні Продавцем істотних
            недоліків Товару та при волевиявленні Покупця, сплачені грошові
            кошти підлягають поверненню останньому на вказані ним реквізити
            протягом 7 (семи) календарних днів з повернення Товару.
          </Typography>
          <Typography variant="body2" mt={2}>
            9.6. У випадках заміни неякісного Товару оплата послуг
            перевізника здійснюється коштом Продавця.
          </Typography>
          <Typography variant="body2" mt={2}>
            9.7. У будь-якому випадку повернення Товару повинно відбуватися
            в оригінальній упаковці, в якій надійшов Товар, із збереженням
            товарного вигляду і споживчих якостей товару.
          </Typography>
          <Typography variant="body2" mt={2}>
            9.8. Всі неврегульовані в цьому Договорі-оферті питання,
            пов’язані з порядком, умовами гарантійного ремонту або заміни
            Товару при виявленні недоліків протягом строку гарантії
            (придатності), регулюються у відповідності до гарантійних
            зобов’язань, визначених виробником відповідного Товару, а у
            випадку невстановлення виробником таких гарантійних зобов’язань
            – у відповідності до чинного законодавства України.
          </Typography>
          <Typography variant="h6" mt={2}>
            10. Відповідальність сторін
          </Typography>
          <Typography variant="body2" mt={2}>
            10.1. Сторони відповідають за невиконання або неналежне
            виконання умов цього Договору в порядку, передбаченому цим
            Договором і чинним законодавством України.
          </Typography>
          <Typography variant="body2" mt={2}>
            10.2. У випадку обставин непереборної сили, сторони звільняються
            від виконання умов цього Договору. Під обставинами непереборної
            сили для цілей цього Договору розуміються події, що мають
            надзвичайний, невідворотний непередбачуваний характер, які
            виключають або об’єктивно перешкоджають виконанню цього
            Договору, настання яких Сторони не могли передбачити й запобігти
            розумними мірами.
          </Typography>
          <Typography variant="body2" mt={2}>
            10.3. Сторона, що посилається на дію обставин непереборної сили
            повинна протягом п’яти календарних днів у письмовому вигляді за
            допомогою електронної пошти повідомити іншу сторону про настання
            таких обставин.
          </Typography>
          <Typography variant="body2" mt={2}>
            10.4. Якщо через дію обставин непереборної сили невиконання
            зобов’язань за цим Договором триває більше п’яти місяців, кожна
            із Сторін має право розірвати цей Договір в односторонньому
            порядку, письмово повідомивши про це іншу сторону.
          </Typography>
          <Typography>
            10.5. Сторони докладають максимальних зусиль для вирішення будь
            – яких розбіжностей виключно шляхом переговорів.
          </Typography>
          <Typography variant="h6" mt={2}>
            11. Інші умови
          </Typography>
          <Typography variant="body2" mt={2}>
            11.1. Інтернет – магазин залишає за собою право в
            односторонньому порядку вносити зміни в цей Договір з
            попередньою публікацією його на сайті «syodo.com.ua»
          </Typography>
          <Typography variant="body2" mt={2}>
            11.2. Інтернет – магазин створений для організації дистанційного
            способу продажу товарів через Інтернет.
          </Typography>
          <Typography variant="body2" mt={2}>
            11.3. Інтернет – магазин не несе відповідальність за зміст і
            правдивість інформації, що надається Покупцем при оформленні
            замовлення.
          </Typography>
          <Typography variant="body2" mt={2}>
            11.4. Покупець несе відповідальність за достовірність вказаної
            при оформленні замовлення інформації.
          </Typography>
          <Typography variant="body2" mt={2}>
            11.5. Оплата Покупцем оформленого в Інтернет – магазині
            замовлення означає повну згоду Покупця з умовами Договору
            купівлі – продажу (публічної оферти Інтернет – магазину) і є
            датою укладення Договору купівлі – продажу між Продавцем і
            Покупцем.
          </Typography>
          <Typography variant="body2" mt={2}>
            11.6. Використання ресурсу Інтернет – магазину для перегляду
            товару, а також для оформлення замовлення є для Покупця
            безоплатним.
          </Typography>
          <Typography variant="body2" mt={2}>
            11.7. Інформація, що надається Покупцем є конфіденційною.
            Інтернет – магазин використовує інформацію про Покупця виключно
            в цілях функціонування Інтернет – магазину (відправлення
            повідомлення Покупцеві про виконання замовлення, надсилання
            рекламних повідомлень і т.д.).
          </Typography>
          <Typography variant="body2" mt={2}>
            11.8. Власним акцептування Договору або реєстрацією на сайті
            «syodo.com.ua» (заповнення реєстраційної анкети) Покупець
            добровільно надає згоду на збір та обробку власних персональних
            даних у зареєстрованій базі Продавця «Контрагенти» з наступною
            метою: дані, що стають відомі Продавцю використовуватимуться в
            комерційних цілях, в тому числі для обробки замовлень на
            придбання товарів, отримання інформації про замовлення,
            надсилання телекомунікаційними засобами зв’язку
          </Typography>
          <Typography variant="body2" mt={2}>
            (Електронною поштою, мобільним зв’язком) рекламних та
            спеціальних пропозицій, інформації про акції, розіграші або
            будь-якої іншої інформації про діяльність магазину.Для цілей,
            передбачених цим пунктом, Продавець має право направляти листи,
            повідомлення та матеріали на поштову адресу, e-mail Покупця, а
            також відправляти sms-повідомлення, здійснювати дзвінки на
            вказаний в анкеті телефонний номер.
          </Typography>
          <Typography variant="body2" mt={2}>
            11.9. Покупець дає Продавцю право здійснювати обробку його
            персональних даних, у тому числі: поміщати персональні дані в
            бази даних Покупця (без додаткового повідомлення Учасника про
            це), здійснювати довічне зберігання даних, їх накопичення,
            оновлення, зміну (у міру необхідності). Покупець бере на себе
            зобов’язання забезпечити захист даних від несанкціонованого
            доступу третіх осіб, не поширювати і не передавати дані
            будь-якій третій стороні (крім передачі даних пов’язаним особам,
            комерційним партнерам, особам, уповноваженим Продавцем на
            здійснення безпосередньої обробки даних для зазначених цілей, а
            також на обов’язковий запит компетентного державного органу).
          </Typography>
          <Typography variant="body2" mt={2}>
            11.10. У випадку небажання отримувати розсилку, Покупець має
            право звернутися до Продавця, написавши заяву про відмову від
            отримання рекламних матеріалів, надіславши його на поштову або
            електронну адресу.
          </Typography>
          <Typography variant="h6" mt={2}>
            12. Термін дії цього договору
          </Typography>
          <Typography variant="body2" mt={2}>
            12.1. Цей договір набирає чинності з дня оформлення замовлення
            або реєстрації в інтернет-магазині «syodo.com.ua» і діє до
            виконання всіх умов договору.
          </Typography>
          <Grid
            container
            item
            xs={12}
            justifyContent="center"
            alignItems="center"
            sx={{ textAlign: "center" }}
          >
            <img
              src={"/assets/images/oda_1.png"}
              alt="Ода - до - смаку"
              style={{ width: "75%" }}
            />
          </Grid>
        </BoxContainer>
      </Grid>
    </Grid>
  </Container>);
}